Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་གཞན་ཇི་སྙེད་ཅིག་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ལ་ལྟ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་སྔོན། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། དགེ་བའི་ཆོས་ཡང་དག་པར་བླང་བ་ལ་ཤིན་ཏུ་བཀོད་པ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་བར་དུ་བྱས་པ་ཤ་སྟག་གོ །
en: All those bodhisattvas and other beings who came to the great Sūrya­prabha Park in order to see the bhikṣuṇī Siṃha­vijṛmbhitā and listen to the Dharma had in the past been established by the bhikṣuṇī Siṃha­vijṛmbhitā in the accomplishment of the roots of merit and set on irreversible progress toward the highest, complete enlightenment.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་བཟའ་ཤིང་གི་ར་བ་ཕུན་སུམ་ཚོགས་པ་དང་། ནགས་ཚལ་ཕུན་སུམ་ཚོགས་པ་དང་། གཙུག་ལག་ཁང་ཕུན་སུམ་ཚོགས་པ་དང་། འཆག་ས་ཕུན་སུམ་ཚོགས་པ་དང་། ལོངས་སུ་སྤྱོད་ཕུན་སུམ་ཚོགས་པ་དང་། མལ་ཆ་ཕུན་སུམ་ཚོགས་པ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་། དབང་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ་དང་། རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་ཕུན་སུམ་ཚོགས་པ་དང་། དབྱངས་ཀྱི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་རྣམ་པ་དེ་ལྟ་བུ་མཐོང་སྟེ།
en: In that way, Sudhana, the head merchant’s son, saw the bhikṣuṇī Siṃha­vijṛmbhitā’s perfect park, perfect forest, perfect vihāra, perfect walkway, perfect enjoyments, perfect seat, perfect assembly, perfect supremacy, perfect miraculous manifestations, and perfect display of eloquence.

source: ཆོས་ཀྱི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པའང་ཐོས་ནས།
en: He heard her inconceivable way of the Dharma.

source: ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཆེན་པོས་སེམས་མངོན་པར་བརླན་པ་དེའི་ཡིད་ལ་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། བསམ་པ་རྣམ་པར་དག་པ་ཕུན་སུམ་ཚོགས་པར་བྱས་ཀྱིས་ད་ནི་གཡས་ཕྱོགས་སུ་བསྐོར་བ་ལན་བརྒྱ་སྟོང་དུ་མ་ཞིག་ཏུ་བྱའོ་སྙམ་པ་དང་།
en: His mind was saturated by a vast cloud of Dharma, and with perfect motivation toward the bhikṣuṇī Siṃha­vijṛmbhitā he thought, “I shall circumambulate her to my right many hundreds of thousands of times.”

source: དེའི་མོད་ལ་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པས། བཟའ་ཤིང་གི་ར་བ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་བཅས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ། །
en: In that instant, the bhikṣuṇī Siṃha­vijṛmbhitā filled the entire park and the assembly with light.

source: དེ་ལྟར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱའོ། །སྙམ་དུ་བསམས་ནས་བསྐོར་བ་བྱེད་པའི་ཚེ། འཁོར་ཐམས་ཅད་ནའང་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་འདུག་པ་མཐོང་ནས་མདུན་དུ་འདུག་སྟེ།
en: He circumambulated her many hundreds of thousands of times and thought, “As I circumambulated, the bhikṣuṇī Siṃha­vijṛmbhitā was always seated before me.”

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: With his hands together in homage he stood before her and said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རློམ་སེམས་ཐམས་ཅད་ཡོངས་སུ་བཅོམ་པ་ཞེས་བ་བ་ཐོབ་པའོ། །སྨྲས་པ།
en: She said, “Noble one, I have attained the bodhisattva liberation called the eradication of all conceit.”

source: འཕགས་མ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རློམ་སེམས་ཐམས་ཅད་ཡོངས་སུ་བཅོམ་པ་དེའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Sudhana asked, “Āryā, what is the scope of that bodhisattva liberation called the eradication of all conceit?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་ནི་ཡེ་ཤེས་སྣང་བ་སྟེ། དུས་གསུམ་དུ་བྱུང་བའི་རྒྱན་སེམས་སྐད་ཅིག་གི་ཆ་ཤས་ལ་རྣམ་པར་དམིགས་པའི་རང་བཞིན་ནོ། །
en: She replied, “Noble one, it is the light of wisdom; it has the nature of perceiving in a fraction of an instant of mind the displays that occur in the three times.”

source: སྨྲས་པ། འཕགས་མ་ཡེ་ཤེས་སྣང་བ་དེའི་ཡུལ་ཡང་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Sudhana asked, “Āryā, what is the scope of that light of wisdom?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་མོ་ཡེ་ཤེས་སྣང་བ་འདི་ལ་སྒྲུབ་པ་དང་ཡོངས་སུ་སྒྲུབ་པའི་ཚེ་ཆོས་ཐམས་ཅད་རབ་ཏུ་འཐད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་སྐྱེས་ཏེ།
en: She replied, “Noble one, when I had striven for and accomplished this light of wisdom, there arose the samādhi called accordance with all Dharmas.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་མ་ཐག་ཏུ་ཡིད་ཀྱི་རང་བཞིན་གྱི་ལུས་ཀྱིས་ཕྱོགས་བཅུ་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པ་དགའ་ལྡན་གྱི་ཕོ་བྲང་ན་བཞུགས་པ། ཐམས་ཅད་རེ་རེ་ལ་ཡང་ལུས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་མཆོད་པ་རྣམ་པ་ཐ་དད་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་མཆོད་པ་སྦྱར་བའི་ཕྱིར་འགྲོ་སྟེ། འདི་ལྟར་ལྷའི་ལུས་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པའི་དབང་པོའི་ལུས་མེ་ཏོག་གི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། སྤོས་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། བདུག་སྤོས་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། ཕྲེང་བའི་སྤྲིན་ཡོངས་ས་འཛིན་པ་དང་། བྱུག་པའི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། ཕྱེ་མའི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། ན་བཟའི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། གདུགས་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། རྒྱལ་མཚན་གྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། བ་དན་གྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། རིན་པོ་ཆེའི་ལྷབ་ལྷུབ་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་།
en: With the attainment of that samādhi, I go in bodies that are made of mind to the bodhisattvas with one life remaining who reside in Tuṣita palaces in all the world realms in all ten directions, so that with bodies as numerous as the atoms in an inexpressible number of buddha realms I can engage in making offerings to each bodhisattva with offerings that are as numerous as the atoms in an inexpressible number of buddha realms.

source: རིན་པོ་ཆེའི་དྲ་བའི་རྒྱན་གྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། རིན་པོ་ཆེའི་གནམ་ཡོལ་གྱི་རྒྱན་གྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། རིན་པོ་ཆེའི་རྒྱན་རྣམ་པར་ཕྱེ་བའི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། རིན་པོ་ཆེའི་སྒྲོན་མའི་རྒྱན་གྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་དང་། རིན་པོ་ཆེའི་གདན་གྱི་རྒྱན་གྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པ་མང་པོས་མཆོད་པ་སྦྱར་བའི་ཕྱིར་འགྲོའོ། །དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པ་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། ཇི་ལྟར་འགྲོ་བ་དེ་བཞིན་དུ་ཡུམ་གྱི་སྐུར་གཤེགས་པ་དང་། བལྟམ་པ་དང་། བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་པ་དང་། མངོན་པར་འབྱུང་བ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་པ་དང་།
en: This means I go as the bodies of lords of devas and as the bodies of nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans, holding clouds of flowers, holding clouds of perfumes, holding clouds of incense, holding clouds of garlands, holding clouds of ointments, holding clouds of powders, holding clouds of clothing, holding clouds of parasols, holding clouds of banners, holding clouds of flags, holding clouds of jewel ornamentations, holding clouds of arrays of nets of jewels, holding clouds of arrays of bejeweled canopies, holding clouds of arrays of spread-out jewels, holding clouds of arrays of bejeweled lamps, and holding clouds of arrays of bejeweled seats so as to engage in making offerings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཤིང་སྙིང་པོ་བྱང་ཆུབ་ལ་བཞུགས་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་། དེ་བཞིན་དུ་ལྷའི་གནས་ན་བཞུགས་པ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པའི་གནས་ན་བཞུགས་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་ཡོངས་སུ་ཚིམ་པར་མཛད་ནས། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དེ་དག་ཐམས་ཅད་ལའང་ཡིད་ཀྱི་རང་བཞིན་གྱི་ལུས་རྣམ་པ་དེ་ལྟ་བུ་དག་གིས་རྣམ་པ་དེ་ལྟ་བུའི་མཆོད་པ་བྱེད་ཅིང་།
en: “In the same way that I go to the bodhisattvas with one life remaining who reside in Tuṣita so as to engage in making offerings, I go in bodies that are made of mind and in such forms engage in offerings to all the tathāgatas who have entered the bodies of their mothers, who are born, who reside within harems, who have gone forth into homelessness, who are going to the bodhimaṇḍa, who are present at the bodhimaṇḍa, who have attained the highest, complete enlightenment of buddhahood, who turn the wheel of the Dharma, and who are entering nirvāṇa having satisfied the minds and wishes of those who reside in the dwellings of the devas and those who reside in the dwellings of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans and in the dwellings of all beings.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་འགྲོའོ། སེམས་ཅན་གང་གིས་ཁོ་མོས་སངས་རྒྱས་མཆོད་པ་དང་། རིམ་གྲོ་བྱེད་པའི་ལས་འདི་ཤེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་རོ། །
en: “Those beings who know my offerings and service to the buddhas will all definitely attain the highest, complete enlightenment.

source: སེམས་ཅན་གང་ཁོ་མོའི་དྲུང་དུ་འོང་བ་དེ་དག་ཐམས་ཅད་ལའང་ཁོ་མོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་འདི་ཉིད་སྟོན་ཏེ།
en: “I give the instructions on the teachings of the perfection of wisdom to all those beings who come to me.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ཡེ་ཤེས་ཀྱི་མིག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་ཡང་། སེམས་ཅན་གྱི་འདུ་ཤེས་ཀྱང་མི་བསྐྱེད་ལ། རློམ་སེམས་ཀྱང་མི་བྱེད་དེ།
en: “Noble one, I look upon all beings with wisdom eyes, but I do not give rise to the concept of ‘beings,’ and I do not become conceited.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐད་རྒྱ་མཚོ་ཡང་ཉན་ཏེ། ཚིག་གི་ལམ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པས། རློམ་སེམས་སུ་བྱེད་པ་མེད་དོ། །
en: I listen to the ocean of the languages of all beings but do not become attached to any way of speaking, and I do not become conceited.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་མཐོང་སྟེ། ཆོས་ཀྱི་ལུས་ཡོངས་སུ་ཤེས་པས་རློམ་སེམས་སུ་བྱེད་པ་མེད་དོ། །
en: I also see all the tathāgatas, but through knowing the body of the Dharma, I do not become conceited.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་འཛིན་ཀྱང་། ཆོས་ཀྱི་རང་བཞིན་ཁོང་དུ་ཆུད་པས་རློམ་སེམས་སུ་བྱེད་པ་མེད་དོ། །
en: I possess the Dharma wheels of all the tathāgatas, but because I have realized the nature of phenomena, I do not become conceited.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་ཀྱང་། ཆོས་ཉིད་སྒྱུ་མའི་རང་བཞིན་ཁོང་དུ་ཆུད་པས་རློམ་སེམས་སུ་བྱེད་པ་མྱེད་དོ། །རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་རློམ་སེམས་ཐམས་ཅད་ཡོངས་སུ་བཅོམ་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་མཐའ་དང་དབུས་མེད་པ་ལ་ཞུགས་པ། ཆོས་ཐམས་ཅད་ལ་རློམ་སེམས་མེད་པར་གནས་ཀྱང་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ།
en: In each instant of mind I permeate the entire realm of phenomena, but because I have realized the illusory nature of phenomena, I do not become conceited.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རང་གི་ལུས་སུ་འདུས་པར་སྟོན་ཀྱང་། སྐད་ཅིག་གཅིག་གིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་འདོང་བ། ལུས་ལ་སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཐམས་ཅད་ལ་འབྱུང་ཞིང་རྒྱུ་བ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་བ་སྤུའི་ཉག་མ་གཅིག་གིས་སྦམས་ཤིང་མངོན་པར་འཕེན་པ། རང་གི་བ་སྤུའི་བུ་གར་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་འདུ་བ་དང་། འཇིག་པའི་བསྐལ་པ་ཡོངས་སུ་སྟོན་པ། སྐད་ཅིག་གཅིག་ལ་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར་གནས་པ།
en: “Noble one, I know this bodhisattva liberation called the eradication of all conceit, but how could I know the conduct or describe the qualities of the bodhisattvas who have comprehended the endless and centerless realm of phenomena, who remain without conceit within all phenomena, who sitting cross-legged alone pervade the entire realm of phenomena, who reveal all buddha realms contained within their bodies, who in a single instant come into the presence of all the tathāgatas, within whose bodies all the miracles of the buddhas take place, who manifest and introduce within a single pore-hair an anabhilāpyānabhilāpya of buddha realms, who manifest in their pores the kalpas of the creation and destruction of an anabhilāpyānabhilāpya of countless world realms, who in one instant enter into the equality of dwelling in an anabhilāpyānabhilāpya of kalpas, and who in one instant move through an anabhilāpyānabhilāpya of kalpas?

source: མཉམ་པ་ཉིད་ཀྱིས་ཡང་དག་པར་འཛུད་པ། སྐད་ཅིག་གཅིག་གིས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བསྐལ་པར་འཁོར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཡུལ་བགྲོད་དཀའ་བ་ན། གྲོང་ཁྱེར་རིན་པོ་ཆེའི་རྒྱན་ཅེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, in the land called Durga, in the city called Ratnavyūha, dwells a courtesan by the name of Vasumitrā.

source: དེ་ན་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct?

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཤེས་རབ་ཀྱི་སྣང་བ་ཆེན་པོ་དེས་སེམས་སྣང་བར་གྱུར་པ་དེ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སྣང་བ་དེ་ལ་ནི་སེམས། ཆོས་ཉིད་ཀྱི་རང་བཞིན་གྱི་སྟོབས་སྣང་བ་དེ་ལ་ནི་ཡང་དག་པར་རྗེས་སུ་ལྟ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་རྣམ་པར་དམྱིགས་པའི་མཛོད་ཀྱི་གཟུངས་ཀྱི་ཚུལ་དེ་ནི་བརྟན་པར་བྱེད། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་འཛིན་པའི་གཟུངས་ཀྱི་ཚུལ་དེ་ནི་ཤིན་ཏུ་རྒྱ་ཆེ་བར་བྱེད། སྙིང་རྗེ་ཆེན་པོ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐྱབས་སུ་གྱུར་པའི་སྟོབས་དེ་ནི་ཉེ་བར་སྟོན། ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་སྣང་བའི་སྒོ་ནས་ཡང་དག་པར་འབྱུང་བའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་དེ་ལ་ནི་རབ་ཏུ་རྟོག །ཆོས་ཀྱི་དབྱིངས་རྒྱ་ཆེན་པོའི་དཀྱིལ་འཁོར་རྒྱས་པར་འགེངས་པའི་སྨོན་ལམ་ཡོངས་སུ་དག་པ་དེའི་རྗེས་སུ་ནི་འབྲང་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣuṇī Siṃha­vijṛmbhitā, circumambulated the bhikṣuṇī Siṃha­vijṛmbhitā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the bhikṣuṇī Siṃha­vijṛmbhitā.

source: ཆོས་ཐམས་ཅད་ཀྱི་ཕྱོགས་སྣང་བར་བྱེད་པའི་ཡེ་ཤེས་ཀྱི་འོད་དེ་ནི་ཤིན་ཏུ་གསལ་བར་བྱེད། ཆོས་ཐམས་ཅད་ཀྱིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་ཕྱེ་བ་རྒྱས་པར་འགེངས་པའི་མངོན་པར་ཤེས་པའི་སྟོབས་དེ་ནི་མངོན་པར་སྒྲུབ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་དང་། དྲན་པ་ཐམས་ཅད་ཉེ་བར་བླངས་པས་བརྩམས་པ་མཐར་དབྱུང་བའི་སྨོན་ལམ་དེ་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་། མཐར་གྱིས་ཡུལ་བགྲོད་དཀའ་བའི་གྲོང་ཁྱེར་རིན་པོ་ཆེའི་རྒྱན་གང་ན་བ་དེར་ཕྱིན་ཏེ། བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ཡོངས་སུ་ཚོལ་ཚོལ་བ་དང་། དེ་ལ་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་གྱི་ཡོན་ཏན་མངོན་པར་མི་ཤེས་ལ་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་གྱི་ཚུལ་ལ་མི་མཁས་པའི་མི་ཇི་སྙེད་པ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Vasumitrā Chapter 28 Sudhana, the head merchant’s son, with his mind illuminated by that great light of wisdom, focusing upon the light of omniscience, regarding the light of the power of the true nature, strengthening the way of retention that is the treasure of what was known from the voices of all beings, increasing the way of retention that possesses the Dharma wheels of all the tathāgatas, supporting the power of the great compassion that is a refuge for all beings, realizing the strength of the omniscience that comes from the gateway of the light of the way of all Dharmas, following the pure aspiration that pervades the domain of the vast realm of phenomena, shining with the light of wisdom that illuminates all the directions of phenomena, accomplishing the power of the higher knowledge that pervades the array of world realms in the ten directions of all phenomena, and fulfilling the aspirations of accomplishing undertaking all the practices, memories, and actions of the bodhisattvas, eventually arrived at the city of Ratnavyūha in the land of Durga and searched for the courtesan Vasumitrā.

source: མི་འདི་དེ་ལྟར་ཞི་ཞིང་དུལ་བའི་དབང་པོ་དང་ལྡན་ལ་དེ་ལྟར་ཤེས་བཞིན་དང་ལྡན་ཏེ། དེ་ལྟར་འཁྲུལ་པ་མེད་ཅིང་དེ་ལྟར་ཡིད་འཁྲུག་པ་མེད་ལ་དེ་ལྟར་གཉའ་ཤིང་གང་ཙམ་དུ་ལྟ་སྟེ། དེ་ལྟར་གནོད་པས་མི་ཚུགས་ཤིང་དེ་ལྟར་མཚན་མར་མི་འཛིན་ལ། གཟུགས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ལ་གཡེང་བ་མེད་པའི་མིག་དང་ལྡན་ཏེ།
en: The people there who did not know the qualities of the courtesan Vasumitrā and lacked the knowledge of the scope of wisdom thought, “What does such a man—who has pacified and controlled senses, who is mindful, who is unconfused, whose mind is not agitated, who keeps his gaze the length of a yoke before him, whose mind is not overcome by sensations, who is not fixated on external features, whose eyes are averted from dwelling on any physical form, whose mind is free of preoccupations, who is wise, who is like an ocean, whose mind is unshakable and without weakness—want with the courtesan Vasumitrā?

source: ཡིད་ལ་བྲེལ་བ་མེད་ཅིང་། བསམ་པ་ཟབ་ལ་མངོན་པར་མཛེས་ཏེ། རྒྱ་མཚོ་ལྟར་འདུག་ཅིང་སེམས་མི་ཉམས་མི་འཁྲུག་པ་དེ་ལ་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མས་ཀོ་ཅི་ཞིག་བྱ། འདི་ལྟ་བུ་དག་ནི་འདོད་ཆགས་ལ་དགའ་བ་མེད་དེ།
en: Someone like this does not delight in sensual pleasures, and so his mind cannot possibly go astray.

source: སེམས་ཕྱིན་ཅི་ལོག་དང་ལྡན་ཡང་མི་སྲིད་དོ། །འདི་ལྟ་བུ་དག་ནི་སྡུག་ཅིང་གཙང་བའི་འདུ་ཤེས་ཡོངས་སུ་རྒྱུ་བ་མེད་དེ།
en: Someone like this does not engage in impure thoughts.

source: འདི་ལྟ་བུ་དག་ནི་འདོད་པས་འཁོལ་ཀྱང་མི་སྲིད་དོ། །
en: It is not possible that someone like this would be a slave to desire.

source: འདི་ལྟ་བུ་དག་ནི་བུད་མེད་ཀྱི་དབང་དུ་འགྱུར་བ་མེད་དེ།
en: Someone like this does not fall under the power of a woman.

source: འདི་ལྟ་བུ་དག་ནི་བདུད་ཀྱི་སྤྱོད་ཡུལ་ལ་སྤྱོད་ཀྱང་མི་སྲིད་དོ། །
en: It is not possible that someone like this is engaged in the field of conduct of the māras.

source: འདི་ལྟ་བུ་དག་ནི་བདུད་ཀྱི་སྤྱོད་ཡུལ་ལ་ཆགས་པ་མེད་དེ།
en: Someone like this does not dwell in the field of conduct of the māras.

source: འདི་ལྟ་བུ་དག་ནི་འདོད་པའི་འདམ་དུ་བྱིང་བ་ཡང་མི་སྲིད་དོ། །
en: It is not possible that someone like this is sinking into the mud of desire.

source: འདི་ལྟ་བུ་དག་ནི་བདུད་ཀྱི་ཞགས་པས་བཅིངས་པར་འགྱུར་བ་མེད་དེ།
en: Someone like this is not bound by the noose of the māras.

source: མི་དགོས་པ་བྱེད་ཀྱང་མི་སྲིད་དོ་སྙམ་མོ། །
en: He is not someone who would do what should not be done.”

source: གང་ཡང་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་ཡོན་ཏན་གྱི་ཁྱད་པར་མངོན་པར་ཤེས་ཤིང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་མངོན་དུ་གྱུར་པ་དེ་དག་ནི་འདི་སྐད་ཅེས་འཛེར་ཏེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ལ་ཡོངས་སུ་དྲི་བར་སེམས་པ་ནི་ཁྱོད་ཀྱང་ཐོབ་པར་བྱ་བ་ལེགས་པར་ཐོབ་པ་སྟེ།
en: Those who did know the special qualities of the courtesan Vasumitrā and directly perceived wisdom’s range of conduct said to him, “It is excellent, excellent, noble one, that you intend to ask questions of the courtesan Vasumitrā; you have perfectly obtained a good outcome.

source: ལེགས་སོ་ལེགས་སོ། །ཁྱོད་ནི་ངེས་པར་སངས་རྒྱས་སུ་སྨོན་པའོ། །
en: You are certainly aspiring to buddhahood.

source: ཁྱོད་ནི་བདག་ངེས་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་བསྒྱུར་བར་འདོད་པའོ། །
en: You are certainly wishing to become a refuge for all beings.

source: ཁྱོད་ནི་ངེས་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་ཀྱི་ཟུག་རྔུ་དབྱུང་བར་འདོད་པའོ། །
en: You are certainly wishing to remove from all beings the pain of desire.

source: ཁྱོད་ནི་ངེས་པར་སྡུག་ཅིང་གཙང་བའི་འདུ་ཤེས་རྣམ་པར་གཏོར་བར་འདོད་པའོ། །
en: You are certainly wishing to dispel conceptions of beauty and purity.

source: རིགས་ཀྱི་བུ་འདེ་རེ་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་ནི་གྲོང་ཁྱེར་གྱི་ལམ་གྱི་སུམ་མདོའི་བྱང་ཕྱོགས་ལོགས་ཤིག་ན་རང་གི་ཁྱིམ་ན་འདུག་གོ །
en: “Noble one, the courtesan Vasumitrā is in her home, which is on the north side of the city’s junction of three streets.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚིག་དེ་ཐོས་ནས་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Sudhana, the head merchant’s son, on hearing those words, was filled with joy, delighted, elated, pleased, and happy.

source: བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མའི་ཁྱིམ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: He went to the home of the courtesan Vasumitrā.

source: དེའི་ཁྱིམ་ཆེ་ཞིང་ཡངས་ལ་རིན་པོ་ཆེའི་ར་བ་རིམ་པ་བཅུས་བསྐོར་བ།
en: He saw that her house was huge and vast and surrounded by ten successive precious walls.

source: རིན་པོ་ཆེ་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བཅུས་ཀུན་ནས་བསྐོར་བ། འོབས་སྤོས་ཆུས་གང་བ། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་པད་མོ་དང་། ཨུཏ་པ་ལ་དང་། ཀུ་མུ་ཏ་དང་།
en: It was encircled by ten successive rows of precious palm trees.

source: མེ་ཏོག་པུན་ད་རི་ཀས་ཆུ་ཡོངས་སུ་ཁེབས་པ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་བ། གཞི་གསེར་གྱི་བྱེ་མ་བདལ་བ། སྤོས་ཡིད་དུ་འོང་བ་དང་། འདྲེས་པའི་ཆུདྲི་ཞིམ་པས་གང་བ། རིན་པོ་ཆེ་སིལ་མ་མང་པོས་ཤིན་ཏུ་བརྒྱན་པ། རིམ་པ་བཅུས་ཀུན་ནས་བསྐོར་བ།
en: It was encircled by ten successive moats filled with water and covered with divine, precious red lotuses, blue lotuses, night lotuses, and white lotuses; they were filled with water that possessed the eight good qualities; they had bottoms that were covered with gold dust; they were filled with aromatic water mixed with beautiful scents; and they were adorned by numerous precious fences.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པའི་ཁང་པ་དང་། གཞལ་མེད་ཁང་དང་། ཁང་པ་བརྩེགས་པས་རྣམ་པར་དགྲིགས་ཤིང་བ་གམ་དང་རྟ་བབས་དང་། སྐར་ཁུང་གི་ཤར་བུ་དང་། ཟླ་གམ་སེང་གེའི་ཤིང་ཏགས་དང་།
en: He saw well-arranged buildings, palaces, kūṭāgāras made from every jewel with high pinnacles, toraṇas, round windows, lattices, crescents, pavilions, shining banners, and so on, brilliant with various jewels.

source: སྣང་བའི་རྒྱལ་མཚན་ལ་སྩོགས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་འོད་ཀྱིས་འབར་བ་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་གྲངས་མེད་པའི་འབྱུང་གནས་ཀྱིས་བརྒྱན་པ།
en: Her house was beautified by walls of countless various jewels.

source: རིན་པོ་ཆེའི་དག་བཻཌཱུཪྻས་སྦས་པའི་གཞི་དང་ལྡན་པ།
en: Its floor was formed of jewels inlaid with beryls.

source: ལྷ་རྫས་ཀྱི་སྤོས་ཞིམ་པོ་ཐམས་ཅད་ཀྱིས་འཁོར་ཐམས་ཅད་ནས་བདུགས་ཤིང་བསངས་པ།
en: Its environs were perfumed by every aromatic divine incense.

source: ཨ་ཀ་རུ་ནག་པོ་མཆོག་གི་བདུག་སྤོས་ཀྱིས་དྲི་ཞིམ་པར་བདུག་པ།
en: It was perfumed by the aroma of supreme black agarwood incense.

source: སྤོས་ཀྱི་བྱུག་པས་འཁོར་ཀུན་ནས་བྱུགས་པ།
en: Its environs were anointed with unguents.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ལན་ཀན་གྱིས་རྩིག་ངོས་ཀུན་ཏུ་བྲེས་པ།
en: Rooftop railings made of various jewels adorned the walls.

source: སྟེང་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་དྲ་བ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་སྤྲས་པས་ཀུན་ནས་བཀབ་པ།
en: It was covered above by nets of Jambu River gold inlaid with various jewels.

source: གསེར་གྱི་དྲིལ་གྱི་དྲ་བ་བརྒྱ་སྟོང་རླུང་གིས་བསྐྱོད་ཅིང་འཁྲོལ་བའི་སྒྲ་ཡིད་དུ་འོང་ཞིང་སྙན་པ་འབྱུང་བ།
en: A hundred thousand networks of hundreds of golden bells were ringing as they were moved by the breeze, emitting a pleasant, beautiful sound.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མེ་ཏོག་གི་སྤྲིན་སིལ་མ་ཀུན་ཏུ་བཀྲམ་པས། རིན་པོ་ཆེའི་མེ་ཏོག་གི་རྒྱན་དང་ལྡན་པ།
en: It was adorned by precious flowers scattered and dispersed from clouds of flowers made from every jewel.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བས་སྒོ་ཤིན་ཏུ་བརྒྱན་པ།
en: The gateways were adorned by erected multicolored banners made of all precious materials.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་འོད་ཀྱི་དྲ་བ་སྣང་བ། མུ་མེད་པར་བརྗོད་དུ་ཡོད་པ།
en: The light from the brilliant shining of various precious jewels shone outward without limit.

source: རིན་པོ་ཆེ་བྱུ་རུའི་སྡོང་པོ་དང་། རྡོ་རྗེ་དང་། མན་ཤེལ་ལ་སྩོགས་པའི་གཏེར་བརྒྱ་སྟོང་ཀུན་གྱིས་ཤེས་པ། ཕུན་སུམ་ཚོགས་པས་མཛོད་མི་ཟད་པ་དང་ལྡན་པ། བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་བཅུས་བརྒྱན་པ་མཐོང་སྟེ།
en: There was an endless treasure of a perfect multitude of hundreds of thousands of precious trees of coral, diamonds, crystal, and so on, and it was beautified by ten parks.

source: དེ་ནས་བཅོམ་པ་མ་ལྷའི་བཤེས་གཉེན་མ་གཟུགས་མཛེས་ཤིང་བཟང་ལ་བལྟ་ན་སྡུག་པ།
en: Sudhana saw there the courtesan Vasumitrā, who was beautiful, attractive, and delightful to see.

source: གྱ་ནོམ་པའི་ཁ་དོག་དམ་པ་རྒྱས་པ་དང་ལྡན་པ།
en: She was endowed with a magnificent, perfect color.

source: གསེར་གྱི་ཁ་དོག་ལྟར་འདུག་པའི་མདོག་ཅན་སྐྲ་མཐོན་ཏིང་དུ་འདུག་པ།
en: She had golden skin and deep black hair.

source: ལུས་ཀྱི་ཡན་ལག་དང་ཉིང་ལག་ཚུལ་དང་འདྲ་བར་རྣམ་པར་གྲུབ་པ།
en: Her limbs and smaller features were all perfectly formed.

source: འདོད་པའི་ཁམས་ཀྱི་ལྷ་དང་མི་ཐམས་ཅད་ལས་འཕགས་པའི་ཁ་དོག་དང་གཟུགས་དང་དབྱིབས་མཛེས་པ་དང་ལྡན་པ།
en: She had a beautiful color, form, and shape that were superior to those of all humans and devas of the desire realm.

source: ཚངས་པ་ལས་ཀྱང་འདས་པའི་དབྱངས་ཀྱི་ཡན་ལག་དང་ལྡན་པ།
en: The aspects of her voice were superior to those of Brahmā.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་སྐད་ཀྱི་ཚུལ་ལ་མཁས་པ།
en: She was skilled in the languages of all beings.
